{
  "id": "10051",
  "protocols.io url": "https://www.protocols.io/view/10051",
  "title": "Environmental DNA (eDNA) 12S metabarcoding Illumina MiSeq NGS PCR Protocol",
  "original description": "The 12S protocol is aimed at amplifying the hypervariable region of the mitochondrial DNA 12S rRNA gene in eukaryotes. The primers (MiFish-U-F & MiFish-U-R) used in this protocol were developed by Miya et al., 2015 for metabarcoding environmental DNA (eDNA) from fishes.    This work was supported by NASA grant NNX14AP62A ‘National Marine Sanctuaries as Sentinel Sites for a Demonstration Marine Biodiversity Observation Network (MBON)’ funded under the National Ocean Partnership Program (NOPP RFP NOAA-NOS-IOOS-2014-2003803 in partnership between NOAA, BOEM, and NASA), and the U.S. Integrated Ocean Observing System (IOOS) Program Office. \nCitation Miya M et a .2015 MiFish, a set of universal PCR primers for metabarcoding environmental DNA from fishes: detection of more than 230 subtropical marine species. R.Soc.opensci. 2: 150088. http://dx.doi.org/10.1098/rsos.150088",
  "steps": "\nPCR\n1. PCR reactions for 12S were performed with a two-step amplification protocol for each sample using the MiFish_U primers (Miya et al., 2015).\n2. The primary PCR amplifications were carried out in triplicate 20 μl reactions using:\n2ul gDNA extract template (1:10 dilution) \n10 μl Hotstar MasterMix (2X) (Qiagen, USA)\n 0.8 μl of each untagged forward and reverse primer (10 μM)\n 7.2 μl molecular biology grade water\n3. PCR reactions were performed in 8-well strip tubes with a no template control (NTC) for each group of environmental sample triplicates and artificial community as a positive control per amplification round using the 12S primary PCR primers below (all primers listed in 5’ to 3’ direction).12S MiFish_U (forward): \nGTC GGT AAA ACT CGT GCC AGC12S MiFish_U (reverse): \nCAT AGT GGG GTA TCT AAT CCC AGT TTG\n4. Primary 12S cycling parameters:\n95 °C for 5 minutes\n40 cycles of 95 °C for 15 seconds\n55 °C for 30 seconds\n72 °C for 30 seconds\nHeld at 4 °C\n5. Secondary PCR amplifications are conducted in triplicate 20 μl reactions using same reaction master mix as primary PCR, but with 0.8 μl of each tagged 12S forward and reverse primer (10 μM) listed below (forward & reverse with matching unique 6-base tag, indicated by Xs). 12S (forward): NNN XXX XXX GTC GGT AAA ACT CGT GCC AGC12S (reverse): NNN XXX XXX CAT AGT GGG GTA TCT AAT CCC AGT TTG\n6. The reaction is carried through with 2 μl of each purified environmental as well as positive and NTC samples.\n7. Secondary 12S tagged PCR cycling parameters:\n95 °C for 5 minutes\nTwenty cycles of 95 °C for 15 seconds\n57 °C for 30 seconds\n72 °C for 30 seconds\nHeld at 4 °C\n\nQuality control, PCR clean-up\n8. After PCR amplification of the marker region, the pooled PCR products were run through an agarose gel to confirm the presence of target bands and absense of non-specific amplification across environmental samples as well as the absence of amplification in no-template controls (NTCs).\n9. PCR products were purified and size selected using the Agencourt AMPure XP bead system (Beckman Coulter, USA).\n10. A second agarose gel was run to confirm primer removal and retention of target amplicons after purification.\n11. Purified products were then quantified using Quant-It Picogreen dsDNA Assay (Life Technologies) on an fmax Molecular Devices Fluorometer with a Qubit dsDNA HS kit.\n12. Equimolar pools were constructed and quantified with Qubit dsDNA HS kit to confirm pool concentration prior to library preparation.\n13. One library was constructed for each location sampled in using the KAPA HyperPrep and Library Quantification kits following manufacturer’s protocol.\n\nSequencing parameters\n14. 12S rRNA gene was sequenced at Stanford Functional Genomics Facility.\n15. The pooled product for each genetic locus was loaded on a standard MiSeq v2 flow cell and sequenced in a 2x250bp paired end format using a v2 500-cycle MiSeq reagent cartridge.\n16. The MiSeq run was performed and 20% PhiX was added.\n17. Base calling was done by Illumina Real Time Analysis (RTA) v1.18.54 and output of RTA was demultiplexed and converted to FastQ format with Illumina Bcl2fastq v2.18.0.\n18. Custom sequencing primers were added to appropriate wells of the reagent cartridge. 12S rRNA\nFK NEXTflex Library barcode 6: CTTGTA\nMB NEXTflex Library barcode 4: GCCAAT\n",
  "total protocol length in tokens": 1135,
  "original description length in tokens": 235,
  "number of steps": 18,
  "ai_generated_description": "The objective of this molecular biology protocol is to amplify the hypervariable region of the mitochondrial DNA 12S rRNA gene in eukaryotes for metabarcoding environmental DNA (eDNA) from fishes using the Illumina MiSeq NGS PCR technique. The primers (MiFish-U-F & MiFish-U-R) used in this protocol were developed by Miya et al., 2015, and aim to detect more than 230 subtropical marine species.",
  "ai_generated_description length in tokens": 97,
  "generated_pseudocode": "def primary_pcr(reaction_params, cycling_params):\n    pass\n\ndef secondary_pcr(reaction_params, cycling_params):\n    pass\n\ndef run_agarose_gel(samples):\n    pass\n\ndef purify_pcr_products(method, samples):\n    pass\n\ndef quantify_pcr_products(method, samples):\n    pass\n\ndef construct_pools(samples, pool_concentration):\n    pass\n\ndef library_preparation(kits, sample_location):\n    pass\n\ndef sequencing(samples, run_params, sequencing_primers, addition_of_phiX):\n    pass\n\ndef base_calling(bcl2fastq_version, rta_version):\n    pass\n\n\n# Protocol steps\nprimary_pcr(reaction_params={'template': '2ul gDNA extract (1:10 dilution)',\n                             'mastermix': '10 μl Hotstar MasterMix (2X)',\n                             'primers': '0.8 μl of each untagged forward and reverse primer (10 μM)',\n                             'water': '7.2 μl molecular biology grade water'},\n            cycling_params={'initial': (95, 5, 'min'), 'cycles': 40,\n                            'denaturation': (95, 15, 'sec'),\n                            'annealing': (55, 30, 'sec'),\n                            'extension': (72, 30, 'sec'),\n                            'final_hold': (4, 'C')})\n\nsecondary_pcr(reaction_params={'mastermix': 'Same as primary PCR',\n                                'primers': '0.8 μl of each tagged 12S forward and reverse primer (10 μM)',\n                                'samples': '2 μl of each purified environmental as well as positive and NTC samples'},\n              cycling_params={'initial': (95, 5, 'min'), 'cycles': 20,\n                              'denaturation': (95, 15, 'sec'),\n                              'annealing': (57, 30, 'sec'),\n                              'extension': (72, 30, 'sec'),\n                              'final_hold': (4, 'C')})\n\nrun_agarose_gel(samples=\"pooled PCR products\")\n\npurify_pcr_products(method=\"Agencourt AMPure XP bead system\", samples=\"PCR products\")\n\nrun_agarose_gel(samples=\"purified PCR products\")\n\nquantify_pcr_products(method=\"Quant-It Picogreen dsDNA Assay\", samples=\"purified products\")\n\nconstruct_pools(samples=\"purified products\", pool_concentration=\"confirmed with Qubit dsDNA HS kit\")\n\nlibrary_preparation(kits=\"KAPA HyperPrep and Library Quantification\", sample_location=\"each location sampled\")\n\nsequencing(samples=\"12S rRNA gene\", run_params=\"MiSeq v2 flow cell, 2x250bp paired end format, v2 500-cycle MiSeq reagent cartridge\", sequencing_primers=\"Custom sequencing primers added to appropriate wells of the reagent cartridge\", addition_of_phiX=\"20% PhiX\")\n\nbase_calling(bcl2fastq_version=\"2.18.0\", rta_version=\"v1.18.54\")\n\n# end of protocol",
  "edited_pseudocode": null
}
