{
  "id": "1007",
  "protocols.io url": "https://www.protocols.io/view/1007",
  "title": "Wet-mount Method for Enumeration of Aquatic Viruses",
  "original description": "Purpose: This method for the enumeration of aquatic viruses is a low-cost alternative to the commonly used filter-mount method. Briefly, fluorescently-stained samples are wetmounted directly onto slides for epifluorescence microscopy after an optional chemical flocculation concentration step used for samples with anticipated virus concentrations of <5×107 viruses mL-1 (samples with >5×107 viruses mL-1 do not require this concentration step prior to analysis). Virus concentration in the wet-mounted sample is determined from the ratio of viruses to microsphere beads, which are added at a known concentration. This wet-mount method for enumerating viruses is significantly less expensive than the filter-mount method (i.e., the cost of microsphere beads per sample is ~500-fold lower than the cost of one filter per sample), and is appropriate for rapid, precise and accurate enumeration of aquatic viruses over a wide range of viral concentrations encountered in field and laboratory samples. The only limitation of this method is that samples with virus concentrations ≤1×106 viruses mL-1 cannot be enumerated, as the abundance of viruses is too low for efficient enumeration.      Figure 1. Overview of the wet-mount method for enumeration of aquatic viruses.",
  "steps": "\nOptional Viral Concentration Method\n1. Place 1 mL of sample into a 1.5 mL microcentrifuge tube.\n2. Add 1 μL Iron Chloride Solution and vortex to mix. \n1amount \nprotocols\n3. Centrifuge the sample at ~14K RCF for 20 minutes. \n1200s\n4. Remove supernatant using a pipette, leaving a small, undisturbed pellet of Fe oxyhydroxides behind (Figure 2).\nimageblocka\nNOTES Note: Removing all of the supernatant is not critical, as a tiny bit remaining will not affect results.\n5. Dissolve the pellet in 10 μL of Ascorbic-EDTA Buffer, creating a 100-fold concentration of the original sample. Vortex and then pipette up and down to ensure complete dissolution. \n10amount \nNOTES Note: A larger volume of buffer may be used to speed pellet dissolution or decrease concentration factor. If a larger volume is used in this step, solution volumes in subsequent steps must be increased accordingly. \nprotocols\n6. Vortex and then pipette up and down to ensure complete dissolution.\n\nVirus Counting Procedure\n7. Combine 10 μL sample (concentrated or unconcentrated) and 2 μL SYBR Gold Working Stock, vortex to mix, and place in dark for 15 minutes. \n2amount \n900s \nprotocols\n8. If sample is unconcentrated, add 1 μL of Ascorbic Acid Antifade Solution. \n1amount \nprotocols\n9. Add 5 μL of glycerol to stained sample and vortex to mix.\n10. Add 2 µL Working Bead Solution to sample. \n2amount \nNOTES Note: The Working Bead Solution must be thoroughly mixed by vortexing prior to adding it to the sample so that the appropriate number of beads are added to the sample. \nprotocols\n11. Clean glass slides and cover slips with isopropanol and Kimwipes.\n12. Thoroughly mix the sample/bead mixture by pipetting up and down, then immediately pipette 10 μL of it onto a glass microscope slide. Place a coverslip over the mixture and avoid trapping air under the coverslip.\n13. Place a coverslip over the mixture and avoid trapping air under the coverslip.\n14. View viruses under ~495 nm excitation at 1000X magnification using an epifluorescence microscope. Count the number of viruses in one defined field of view.\n15. Once complete, switch off the excitation and turn on the white light of the microscope to count the beads in the same field of view (Figure 3).\nimageblocka\n16. Repeat Step 14 & 15 by counting viruses and beads in multiple fields until at least 100 of each have been counted.\n17. The concentration of viruses can then be determined with the following equation: \nimageblocka\nNOTES cvirus= * * cbeads  where:  cvirus = concentration of viruses (viruses ml -1 )  nvirus = total number of viruses counted in all fields  nbeads = total number of beads counted in all fields  vbeads = volume of Working Bead Solution added  vsample = volume of sample used (if the sample has been concentrated with iron chloride flocculation, use the pre-concentration sample volume here)  cbeads = concentration of beads in Working Bead Solution (beads mL -1 ) \nNOTES cvirus= * * cbeads  where:  cvirus = concentration of viruses (viruses ml -1 )  nvirus = total number of viruses counted in all fields  nbeads = total number of beads counted in all fields  vbeads = volume of Working Bead Solution added  vsample = volume of sample used (if the sample has been concentrated with iron chloride flocculation, use the pre-concentration sample volume here)  cbeads = concentration of beads in Working Bead Solution (beads mL -1 )\n18. Prepared samples can be stored at -20ºC either in the microcentrifuge tube (i.e., after completing Step 4) or after mounted on slides (i.e., after completing Steps 12&13) with no significant change in the calculated virus concentration.  \nNOTES Note: these storage conditions have currently been validated for a time period of 7 days.\n",
  "total protocol length in tokens": 1175,
  "original description length in tokens": 240,
  "number of steps": 18,
  "ai_generated_description": "The objective of this scientific protocol is to provide a low-cost alternative method, called wet-mount, for enumerating aquatic viruses using epifluorescence microscopy. This method is efficient, rapid, precise, and appropriate for a wide range of viral concentrations that may be encountered in field and laboratory samples.",
  "ai_generated_description length in tokens": 60,
  "generated_pseudocode": "def place_sample_into_tube(sample, sample_vol):\n    pass\n\ndef add_iron_chloride_solution(sample, iron_chl_solution_vol):\n    pass\n\ndef centrifuge_sample(sample, rcf, time):\n    pass\n\ndef remove_supernatant(sample, pipette_method):\n    pass\n\ndef dissolve_pellet(sample, buffer_vol, buffer_type):\n    pass\n\ndef mix_sample_and_buffer(sample, vortex_method):\n    pass\n\ndef add_stain_and_incubate(sample, stain_vol, incubation_time, dark):\n    pass\n\ndef add_antifade_solution(sample, antifade_solution_vol):\n    pass\n\ndef add_glycerol(sample, glycerol_vol):\n    pass\n\ndef add_working_bead_solution(sample, working_bead_solution_vol):\n    pass\n\ndef clean_glass_slide_and_coverslip(clean_method):\n    pass\n\ndef dispense_sample_onto_slide(sample, sample_vol):\n    pass\n\ndef place_coverslip(sample):\n    pass\n\ndef count_viruses_microscope(sample, excitation_wavelength, magnification):\n    pass\n\ndef count_beads_microscope(sample, light_type, magnification):\n    pass\n\ndef repeat_counting_viruses_beads(sample, n_virus, n_beads, times):\n    pass\n\ndef calculate_virus_concentration(sample, n_virus, n_beads, v_beads, v_sample, c_beads):\n    pass\n\ndef store_prepared_samples(sample, storage_temp):\n    pass\n\n# Protocol steps\nsample = \"aquatic_sample\"\nplace_sample_into_tube(sample, sample_vol=\"1 mL\")\nadd_iron_chloride_solution(sample, iron_chl_solution_vol=\"1 μL\")\ncentrifuge_sample(sample, rcf=\"14K\", time=\"20 minutes\")\nremove_supernatant(sample, pipette_method=\"leave pellet undisturbed\")\ndissolve_pellet(sample, buffer_vol=\"10 μL\", buffer_type=\"Ascorbic-EDTA\")\nmix_sample_and_buffer(sample, vortex_method=\"vortex and pipette\")\nadd_stain_and_incubate(sample, stain_vol=\"2 μL\", incubation_time=\"15 minutes\", dark=True)\n\n# If sample is unconcentrated\nadd_antifade_solution(sample, antifade_solution_vol=\"1 μL\")\n\nadd_glycerol(sample, glycerol_vol=\"5 μL\")\nadd_working_bead_solution(sample, working_bead_solution_vol=\"2 µL\")\nclean_glass_slide_and_coverslip(clean_method=\"isopropanol and Kimwipes\")\ndispense_sample_onto_slide(sample, sample_vol=\"10 μL\")\nplace_coverslip(sample)\ncount_viruses_microscope(sample, excitation_wavelength=\"495 nm\", magnification=\"1000X\")\ncount_beads_microscope(sample, light_type=\"white light\", magnification=\"1000X\")\nrepeat_counting_viruses_beads(sample, n_virus, n_beads, times=\"multiple fields until at least 100 of each are counted\")\ncalculate_virus_concentration(sample, n_virus, n_beads, v_beads, v_sample, c_beads)\nstore_prepared_samples(sample, storage_temp=\"-20ºC\")\n# end of protocol",
  "edited_pseudocode": null
}
