{
  "id": "10779",
  "protocols.io url": "https://www.protocols.io/view/10779",
  "title": "Flash Freeze Fruit Flies in Liquid Nitrogen",
  "original description": "A protocol for routine flash freezing of fruit fly samples prior to use in downstream protocols (e.g. RNA extraction).    ",
  "steps": "\nFly Sample Collection\n1. When virgins are collected count how many are placed into each vial and write this on the outside of the vial.\n2. Check virgin collection vials for larvae.\n3. If no larvae present, consolidate by E# (cross identifier) into a single vial and write total number of flies for all vials corresponding to progeny from that cross of that type on the vial.\n\nOne Day to One Week Before Freezing\n4. Create a spreadsheet that will record the information for all your samples and where they will be located in the freezer box and in the -80 freezer.\n5. Before starting, check virgin collection vials for virginity a second time.\n6. Pre-label freezer box with Experiment Title, Block # (if there are multiple blocks), Date, your name and email.\n7. Pre-label Cryovials with V# (identifier for order vials are frozen in, starting @ 1), E # (cross identifier), sex, genotype, block #, and date; add the # of flies when you actually freeze. This information comes from your spreadsheet. You can use shorthand- but it should be explained longhand in your spreadsheet.\n\nDay of the Freeze Before Starting\n8. Put tape on bench to note the time tubes should be frozen (we allow flies 15 minutes to relax after being pounded through the funnel into the Cryovial).\n9. Get liquid Nitrogen before starting at 3 p.m. (or the time you have chosen ... this will be fixed for all your experiments) and put in a rectangular Styrofoam tub that is big enough to hold two freezer boxes. Remember all flies must be frozen in a 2 hour window.\n\nFreezing\n10. If you are freezing Cryovials of multiple genotypes, arrange vials so that no one factor is grouped by time (aka have a few of each genotype frozen at the same time). The easiest way to do this is to freeze all the vials that correspond to the first replicate, then the second replicate and so on.\n11. For large freezes, we generally have 2 or more people seated in front of the racks of vials and freeze them from left to right front to back (with each person putting the flies in the vials in their section into cryotubes).\n12. For freezes that do not use anesthetic- Select pre-labeled Cryovial and virgin vial, pound flies through funnel into Cryovial. Screw lid on loosely, but securely.\n13. For freezes under CO2, knock-out flies, count them on the pad and sweep into the Cryovial. Screw lid on loosely, but securely.\n14. Place Cryovial with flies in it on tape and note the time (we usually do this by grouping cryovials in 5 minute blocks) and in approx. 15 minutes place the cryovials in order by V number from left to right front to back directly into the freezer box that is sitting in liquid nitrogen. Make sure to do this quickly and that the vial is submerged. You can use tweezers to submerge the vial first to the side of the box and then put it in the right position in the box.\n15. After you freeze them you can use the tweezers to rearrange them so that they are logical in terms of replicates and types or leave them in the freeze order. Whichever you do, you must make sure that your spreadsheet records where each cryovial is located in the box (A1 is the first slot, row A, column 1).\n",
  "total protocol length in tokens": 768,
  "original description length in tokens": 24,
  "number of steps": 15,
  "ai_generated_description": "The objective of this scientific protocol is to flash freeze fruit fly samples in liquid nitrogen, an efficient preservation method for downstream applications such as RNA extraction. The steps in the protocol ensure accurate sample identification and organization, and guarantee that all samples are frozen within a two-hour window for consistency across experiments.",
  "ai_generated_description length in tokens": 58,
  "generated_pseudocode": "def count_virgins(vials):\n    pass\n\ndef check_vials_for_larvae(vials):\n    pass\n\ndef consolidate_vials_by_cross(vials):\n    pass\n\ndef create_spreadsheet(sample_data, freezer_storage):\n    pass\n\ndef check_virginity(vials):\n    pass\n\ndef pre_label_freezer_box(experiment_info):\n    pass\n\ndef pre_label_cryovials(vial_data):\n    pass\n\ndef prepare_time_tape(minutes_to_relax):\n    pass\n\ndef get_liquid_nitrogen(time, container):\n    pass\n\ndef arrange_vials_by_genotype_and_replicate(vials, replicates):\n    pass\n\ndef flash_freeze_without_anesthetic(freeze_params):\n    pass\n\ndef flash_freeze_with_anesthetic(freeze_params):\n    pass\n\ndef place_cryovials_in_freezer_box(cryovials, box, time, order):\n    pass\n\ndef rearrange_cryovials_in_box(cryovials, spreadsheet, order):\n    pass\n\n# Protocol steps\ncount_virgins(vials=\"collection vials\")\ncheck_vials_for_larvae(vials=\"collection vials\")\nconsolidate_vials_by_cross(vials=\"collection vials\")\ncreate_spreadsheet(sample_data=\"fly samples\", freezer_storage=\"-80 freezer\")\ncheck_virginity(vials=\"collection vials\")\npre_label_freezer_box(experiment_info=\"Experiment title, block #, date, name, email\")\npre_label_cryovials(vial_data=\"spreadsheet data\")\nprepare_time_tape(minutes_to_relax=15)\nget_liquid_nitrogen(time=\"3 p.m.\", container=\"rectangular Styrofoam tub\")\narrange_vials_by_genotype_and_replicate(vials=\"cryovials\", replicates=\"replicates 1, 2, etc.\")\nflash_freeze_without_anesthetic(freeze_params=\"large freezes, multiple people, racks of vials, left to right front to back\")\nflash_freeze_with_anesthetic(freeze_params=\"large freezes, multiple people, racks of vials, left to right front to back, CO2\")\nplace_cryovials_in_freezer_box(cryovials=\"cryovials with flies\", box=\"freezer box in liquid nitrogen\", time=\"15 minutes\", order=\"V number order\")\nrearrange_cryovials_in_box(cryovials=\"frozen cryovials\", spreadsheet=\"sample spreadsheet\", order=\"replicates and types or freeze order\")\n# end of protocol",
  "edited_pseudocode": null
}
