{
  "id": "145",
  "protocols.io url": "https://www.protocols.io/view/145",
  "title": "Ethanol precipitation of nucleic acids (Eppendorf tubes)",
  "original description": "Nucleic acid precipitation is used to concentrate and/or purify nucleic acids. The below protocol is based on the fact that nucleic acids are less soluble in alcohol than in more polar water. Addition of salt further decreases solubility by competing for water dipoles; as does low temperature. Please see the OpenWetWare website for more details.  Citation: OpenWetWare contributors, 'Ethanol precipitation of nucleic acids', OpenWetWare, , 1 July 2012, 10:48 UTC, <http://openwetware.org/index.php?title=Ethanol_precipitation_of_nucleic_acids&oldid=611420> [accessed 21 January 2015]",
  "steps": "\nNone\n1. Add 1/10 volume of 3M sodium acetate, pH 5.2 or 1/2 volume of 5M ammonium acetate.  \nreagents\n2. Add 2-3 volumes of 100% Ethanol.\n3. Mix and freeze overnight in -20.  \nNOTES In general, the time you need to incubate in the freezer depends on how much nucleic acid you have, how big it is and the volume it is in. My general protocol is to freeze for 20 min to 1 hr at -80 ˚C. This seems to work well for most things, but you may want to freeze longer if you have only a small concentration of nucleic acid or if it is small in size(<15 nucleotides). (Kathleen) \nNOTES If you are in a hurry, you can also dip you epi shortly into liquid nitrogen. If you added enough ethanol, the mix won't freeze. Careful with isopropanol - it freezes more quickly. This works well for me and saves me a lengthy incubation in the fridge. (Jasu)\n4. Spin at full speed in a standard microcentrifuge at 4 degrees for 30 minutes.  \n1800s\n5. Decant (or carefully pipet off) the supernatant.\n6. Dry the pellet.   \nNOTES For this you can air dry (tubes open, ~15 min) or dry in a speedvac. DNA and RNA (if you don't have RNases in your sample) are typically hearty enough for you to air dry at 37 ˚C, if desired. \nNOTES Overdrying can make DNA hard to re-dissolve. Especially for longer DNA, I avoid vacuum drying and airdry only briefly before re-dissolving. (Jasu)\n7. Add your desired quantity of water. Vortex and spin down to resuspend.  \nNOTES Beware of using water unless you are sure of what you are getting in to. The \"pH\" of water can vary widely (I've seen from pH 5 to pH 8.5), and depurination of DNA at low pH or degradation of RNA at high pH are possibilities. Water also typically contains trace metals, which can accelerate these reactions. I typically recommend resuspension in TE (10 mM Tris-HCl, pH 7.5, 1 mM EDTA). This makes sure your nucleic acid is at a neutral pH and the EDTA will chelate any trace metals. Since they are in such small amounts, neither the buffer nor the EDTA will affect most downstream reactions. (Kathleen)\n",
  "total protocol length in tokens": 726,
  "original description length in tokens": 151,
  "number of steps": 7,
  "ai_generated_description": "The objective of this molecular biology protocol is to concentrate and purify nucleic acids using ethanol precipitation. The method is based on the principle that nucleic acids are less soluble in alcohol than in water, and the addition of salt and low temperatures further decrease solubility, enabling the precipitation and purification of nucleic acids.",
  "ai_generated_description length in tokens": 64,
  "generated_pseudocode": "def add_salt(solution, salt, volume_ratio):\n    pass\n\ndef add_ethanol(solution, volumes_ethanol):\n    pass\n\ndef mix_solution(solution):\n    pass\n\ndef incubate_freeze(solution, temperature, time):\n    pass\n\ndef spin_tube(solution, spin_params):\n    pass\n\ndef remove_supernatant(solution):\n    pass\n\ndef dry_pellet(pellet, method, time):\n    pass\n\ndef resuspend_pellet(pellet, solvent, volume):\n    pass\n\n# Protocol steps\nadd_salt(solution=\"nucleic_acid_solution\", salt=\"3M sodium acetate, pH 5.2\", volume_ratio=1/10)\nadd_ethanol(solution=\"nucleic_acid_solution\", volumes_ethanol=2)\nmix_solution(solution=\"nucleic_acid_solution\")\nincubate_freeze(solution=\"nucleic_acid_solution\", temperature=-20, time=\"overnight\")\nspin_tube(solution=\"nucleic_acid_solution\", spin_params=\"full speed, 4 degrees, 30 minutes\")\nremove_supernatant(solution=\"nucleic_acid_solution\")\ndry_pellet(pellet=\"pellet\", method=\"air_dry\", time=\"~15 min\")\nresuspend_pellet(pellet=\"pellet_a\", solvent=\"TE_buffer\", volume=\"desired volume\")\n# end of protocol",
  "edited_pseudocode": null
}
