{
  "id": "14715",
  "protocols.io url": "https://www.protocols.io/view/14715",
  "title": "Examine the relationship between expertise, performance, and gaze behavior",
  "original description": "To examine the relationship between expertise, performance, and gaze behavior, eye-tracking was conducted while pilots (n = 24) and non-pilots (n = 26) completed a complex error-detection cockpit task. During this task, video-clips from a pilot’s viewpoint were shown and the participants were asked to detect malfunctions in the cockpit instrument panel. Statistics of eye-tracking results were processed in SPSSStatistics app using two-way repeated measures ANOVA analyses, with AOI as repeated measures factor and independent T-tests. Furthermore, a special measure was calculated to assess scan pattern systematicity differences between pilots and non-pilots, the scan entropy value. Beside, performance on a specific expertise-domain related task, the error-detection cockpit task, generic tasks (Navon Level-Switching task and Coherent Motion task) assessing attentional generic skills were completed by all participants. Outcome scores of generic tasks were analyzed using independent T-tests and a stepwise regression analysis was conducted to assess which generic skill might be related to the specific skill of detecting errors in a cockpit display accurately.",
  "steps": "\n\n1. The error-detection cockpit task (1st day): Participant scores on the RPE Borg scale his or her rate of perceived exertion at that moment.\n2. The participant receives instructions about the error-detection cockpit task: Monitor the instruments of the cockpit and click with the computer mouse on the instrument that shows an error. Sometimes the cockpit functions correct, and in this case, there does not need to be clicked. After each clip a multiple-choice question \"I did not click because\" needs to be answered. In case the participant did click (because an instrument was failing according to him or her), \"non-applicable\" can be chosen as answer for the multiple-choice question. Correct functioning cockpit video clips can be identified with this multiple-choice question as \"no error\". The participant can also answer \"because I was too late\" or \"because I have no idea\" on this multiple-choice question. In case, the participant was too late to click on the failing instrument, the answer can be provided verbally and written down by the researcher.\n3. Participant is seated in front of the Tobii T120 eye-tracker at a distance of approximately 60 cm.\n4. Instruction video (10 minutes) containing a detailed explanation of the different cockpit-instruments is shown to the participant.\n5. The eye-tracker is calibrated and the participant is instructed to restrict the head movements to the absolute minimum.\n6. 16 video clips of the cockpit (filmed during the day) in which occasionally one of the instruments will stop working are shown. In some video clips the cockpit just functions correctly.\n7. At the end of the first day the participant indicates an RPE score again.\n8. The generic tasks (2nd day): Participant receives instructions about the Coherent Motion task: Detect the direction of coherent moving dots between 600 random moving dots. Indicate this direction as accurate as possible with the errors on the keyboard. The trial starts with 25 practice trials and the fixation cross on the middle of the screen provides feedback (turns green in case of a correct answer and red in case of an incorrect answer).\n9. After the practice trials, 200 experimental trials are completed.\n10. Participant receives instructions about the Navon Level-Switching task: A white figure (global level) is shown on a black background drawn by smaller figures (local level) instead of a line. Detect squares or circles both at global or local level by pressing F on the keyboard as fast and accurate as possible when a square was observed and J on the keyboard as fast and accurate as possible when a circle was detected. First 20 practice trials appear, followed immediately by the actual test trials (n = 64).\n",
  "total protocol length in tokens": 781,
  "original description length in tokens": 221,
  "number of steps": 10,
  "ai_generated_description": "The objective of this scientific protocol is to use eye-tracking technology to examine the relationship between expertise, performance, and gaze behavior in pilots and non-pilots as they perform a complex error-detection cockpit task. The study also uses generic tasks to assess attentional skills in each participant, and then seeks to determine if these skills are related to the specific skill of error detection in a cockpit display.",
  "ai_generated_description length in tokens": 79,
  "generated_pseudocode": "def evaluate_RPE(participant):\n    pass\n\ndef instruct_cockpit_error_task(participant):\n    pass\n\ndef record_responses(participant, question_type):\n    pass\n\ndef setup_eye_tracker(participant, eye_tracker_model, distance):\n    pass\n\ndef play_instruction_video(participant, duration):\n    pass\n\ndef calibrate_eye_tracker(participant, instructions):\n    pass\n\ndef play_cockpit_videos(participant, num_videos):\n    pass\n\ndef instruct_generic_tasks(participant, task):\n    pass\n\ndef run_coherent_motion_task(participant, num_practice_trials, num_experiment_trials, notification_type):\n    pass\n\ndef run_navon_level_task(participant, num_practice_trials, num_test_trials):\n    pass\n\n# Identify participant\nparticipant = \"Participant X\"\n\n# Protocol steps\n\n# Day 1\nevaluate_RPE(participant)\ninstruct_cockpit_error_task(participant)\nsetup_eye_tracker(participant, eye_tracker_model=\"Tobii T120\", distance=\"60 cm\")\nplay_instruction_video(participant, duration=\"10 minutes\")\ncalibrate_eye_tracker(participant, instructions=\"restrict head movements to minimum\")\nplay_cockpit_videos(participant, num_videos=16)\nrecord_responses(participant, question_type=\"multiple choice\")\nevaluate_RPE(participant)\n\n# Day 2\ninstruct_generic_tasks(participant, task=\"Coherent Motion task\")\nrun_coherent_motion_task(participant, num_practice_trials=25, num_experiment_trials=200, notification_type=\"fixation cross color\")\ninstruct_generic_tasks(participant, task=\"Navon Level-Switching task\")\nrun_navon_level_task(participant, num_practice_trials=20, num_test_trials=64)\nrecord_responses(participant, question_type=\"keyboard inputs\")\n# end of protocol",
  "edited_pseudocode": null
}
