{
  "id": "14801",
  "protocols.io url": "https://www.protocols.io/view/14801",
  "title": "CRISPR Editing of Immortalized Cell Lines with RNPs using Neon Electroporation",
  "original description": "This protocol describes how to deliver ribonucleoprotein (RNP) complexes that consist of purified Cas9 nuclease duplexed with chemically modified synthetic single guide RNA (sgRNA) to immortalized adherent or suspension cells. RNP delivery is accomplished using the Thermo Fisher NeonTM Transfection System. A reference for electroporation settings for a wide variety of cell types is included. A option for knock-in is included. Chemically modified sgRNAs are designed to resist exonucleases and innate intracellular immune cascades that can lead to cell death. Synthego chemically modified synthetic sgRNAs are of exceptional purity and consistently drive high editing frequencies.\n \n \n ",
  "steps": "\nPre-Electroporation\n1. Subculture cells 2 days before electroporation and seed cells in an appropriately sized vessel so that they are 70-80% confluent on the day of transfection. Each electroporation reaction will require approximately 1 x 105 - 2 x 105 cells, depending on the cell type.  \nNOTES For cell type specific information, refer to linkThermo Fisher NeonTM Transfection System Protocols and Cell Line Data. \n172800s\n\nSetup & Electroporation - Prepare Destination Plate\n2. Pre-warm 1 ml of normal growth medium in each well of a 12-well cell culture plate per reaction.   \n1amount \nNOTES This will serve as the destination plate after electroporation.\n\nSetup & Electroporation - Assemble RNP Complexes \n3. Prepare sgRNA stock at 30 µM and Cas9 nuclease stock at 20 µM, and store at -80°C until use.-80°C\n4. Synthego recommends sgRNA:Cas9 ratios between 3:1 and 9:1 for RNP formation. Below is an example\nusing an sgRNA to Cas9 ratio of 9:1 for a single reaction (scale up appropriately). In appropriate plates/ tubes, assemble RNP complexes in the order shown below. \nNOTES The sgRNA:Cas9 ratio may need to be determined empirically to achieve optimal editing efficiency. \nimage \nNOTES Knock-in Option: to knock in small inserts (<50 bp), an ssDNA HDR Template can be added. The recommended length of each homology arm is at least 50 bp. Add 1 µl 60 µM ssDNA HDR Template per reaction to each well. Optimization may be required. To knock in larger inserts and for more information on designing knock-in experiments, see linkTips and Tricks: Design and Optimization of CRISPR Knock-in Experiments.\n5. Incubate RNPs for 10 minutes at room temperature.      \n600s\n\nSetup & Electroporation - Prepare Cells\n6. NOTES For suspension cells: spin down cells before each aspiration of culture medium and washes. Skip  steps 7 and 8 below. \nAspirate cell culture medium and wash cells 1-2 times with 1X PBS.\n7. Add TrypLE Express and incubate the cells for ~5 minutes, or until they detach from the plate completely.      \n300s \nNOTES Do not shake or hit the flask to dislodge cells, as this may lead to clumping and inaccuracies in cell counting.\n8. Neutralize the dissociation reaction with 2X volume of normal growth medium.\n9. Count cells to determine the cell density.\n10. Transfer 1-2 x 106 cells to a sterile microfuge tube. One tube will contain enough cells for ~10 transfections.\n11. Centrifuge cells for 5 minutes at 500 x g. Aspirate medium.      \n300s\n12. Wash the cells once with 1X PBS.\n13. Centrifuge cells for 5 minutes at 500 x g. Aspirate PBS.      \n300s\n14. Resuspend the cell pellet in 50 μl of resuspension buffer R (provided with NeonTM Transfection System 10 μl Kit).      \n50amount \nNOTES Avoid storing the cell suspension for more than 15 minutes at room temperature, as this reduces cell viability and transfection efficiency.\n15. Add 5 μl of cell suspension to each RNP solution (7 μl) to make 12 μl of cell-RNP solution per reaction.      \n5amount \n7amount\n\nSetup & Electroporation - Transfect Cells\n16. Aspirate 10 μl of cell-RNP solution to a 10 μl Neon tip.      \n10amount\n17. Electroporate using cell type optimized conditions.      \nNOTES Refer to linkThermo Fisher NeonTM Transfection System Protocols and Cell Line Data.\n18. Immediately transfer cells to a pre-warmed 12-well plate (prepared in step 2).\n19. Incubate the cells for 2-3 days in a humidified 37°C/5% CO2 incubator.      \n36temperature \n172800s\n\nPost-Electroporation - Analysis\n20. Extract DNA from cells.\n21. Conduct analyses to determine editing efficiency: PCR, Sanger sequencing, and linkICE analysis. Next-Gen Sequencing, FACS, or functional tests may be conducted as alternatives.      \nNOTES Option: If storing cells for future use is desired, split cells into two groups (one for analysis and one for cell culture).\n",
  "total protocol length in tokens": 1130,
  "original description length in tokens": 139,
  "number of steps": 21,
  "ai_generated_description": "This protocol outlines the process of delivering ribonucleoprotein (RNP) complexes, which consist of purified Cas9 nuclease duplexed with chemically modified synthetic single guide RNA (sgRNA), to immortalized cells using the Thermo Fisher Neon™ Transfection System. The method aims to provide reliable and high frequency CRISPR editing in both adherent and suspension cell types, with an option for knock-in.",
  "ai_generated_description length in tokens": 85,
  "generated_pseudocode": "def immune_cell_subculture(subculture_days, vessel_size, cell_confluence):\n    pass\n\ndef prepare_destination_plate(medium_ml_per_reaction):\n    pass\n\ndef assemble_rnp_complexes(sgRNA_stock, cas9_nuclease_stock, sgRNA_Cas9_ratio, ssDNA_HDR_Template, knock_in_option):\n    pass\n\ndef incubate_rnps(incubation_time, incubation_temperature):\n    pass\n\ndef cell_preparation(suspension_cells, cell_culture_medium, aspiration_repeat_times, PBS_volumes, trypLE_express_volumes):\n    pass\n\ndef cell_detach_timer(detach_time):\n    pass \n\ndef neutralize_dissociation_reaction(normal_growth_medium_volume):\n    pass\n\ndef cell_counting():\n    pass\n\ndef cell_transfer(cell_numbers, microfuge_tube):\n    pass\n\ndef cell_wash(centrifuge_parameters, wash_medium):\n    pass\n\ndef cell_resuspend(cell_pellet_volume, resuspension_buffer):\n    pass\n\ndef adjust_cell_suspension(cell_volume_added, RNP_solution_volume):\n    pass\n\ndef bio_transfection(cell_RNP_solution_volume, neon_tip_volume):\n    pass\n\ndef optimize_conditions_for_transfection(cell_type):\n    pass\n\ndef post_electroporation_prep(destination_plate, well_incubation_time, cell_incubation_conditions):\n    pass\n\ndef dna_extraction():\n    pass\n\ndef editing_efficiency_analysis(analyses):\n    pass\n\ndef storing_cells(storing_option):\n    pass\n\n# Protocol steps in Python pseudocode\n\nimmune_cell_subculture(2, 'appropriate size', '70-80%')\nprepare_destination_plate(1)\nassemble_rnp_complexes(30, 20, '9:1', 60, '<50 bp')\nincubate_rnps(10, 'room_temperature')\ncell_preparation(True, 'culture_medium', 1-2, '1X PBS', 'appropriate_volume_of_trypLE_express')\ncell_detach_timer(5)\nneutralize_dissociation_reaction('2X volume')\ncell_counting()\ncell_transfer(1-2 * 10**6, 'sterile')\ncell_wash(('5 minutes', 500), '1X PBS')\ncell_resuspend(50, 'buffer R')\nadjust_cell_suspension(5, 7)\nbio_transfection(12, 10)\noptimize_conditions_for_transfection('cell_type')\npost_electroporation_prep('pre-warmed', 'immediately', ('2-3 days', 37, '5% CO2'))\ndna_extraction()\nediting_efficiency_analysis(['PCR', 'Sanger sequencing', 'ICE analysis'])\nstoring_cells('if needed')",
  "edited_pseudocode": null
}
